In [24]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [5]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'

df_data = pd.read_csv(url, sep='\s+', header= None)    # seperator : 데이터 나누는 기준, header : 컬럼 이름들이 들어가있는가

In [6]:
# df_data.columns = ["TEST" , ,,,]    # 컬럼명도 설정 가능하다
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [13]:
df_data.values

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

### Pandas의 구성

- Series : DataFrame 중 하나의 Column에 해당하는 데이터 모음
- DataFrame : Data Table 전체 포함하는 객체

In [11]:
list_data = [1,2,3,4,5]
list_index = ['q','w','e','r','t']    # index 이름도 지정가능
example_obj = Series(data = list_data, index= list_index)
example_obj

q    1
w    2
e    3
r    4
t    5
dtype: int64

In [14]:
example_obj["q"]    # index로 접근

example_obj["r"] = 100   # index 값으로 값 할당

In [60]:
# dict type으로 생성
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city','older'])

# 해당 컬럼만 들고올 수 있다 & 새로운 컬럼을 추가할 수도 있다
df2 = pd.DataFrame(raw_data, columns = ['first_name', 'last_name','new_column'])
df2

  first_name last_name new_column
0      Jason    Miller        NaN
1      Molly  Jacobson        NaN
2       Tina       Ali        NaN
3       Jake    Milner        NaN
4        Amy     Cooze        NaN

In [42]:
df.first_name    # column 선택 후 series 추출
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [43]:
df.loc[1]   # 1번째 row를 가져옴

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
order               NaN
Name: 1, dtype: object

In [44]:
df.age.iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [45]:
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [27]:
s.loc[:3]    # 처음부터 index 값 '3'까지

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [46]:
s.iloc[:3]    # 처음부터 3번째 까지

49   NaN
48   NaN
47   NaN
dtype: float64

In [61]:
df.older = df.age > 40
df

  first_name last_name  age           city  older
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [52]:
 # transpose
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
older                True       True  False    False    True

In [53]:
# 값 출력
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [55]:
# csv로 변환
df.to_csv()

',first_name,last_name,age,city,older\r\n0,Jason,Miller,42,San Francisco,True\r\n1,Molly,Jacobson,52,Baltimore,True\r\n2,Tina,Ali,36,Miami,False\r\n3,Jake,Milner,24,Douglas,False\r\n4,Amy,Cooze,73,Boston,True\r\n'

In [62]:
# column delete
del df["older"]
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

##### Selection & Drop

In [67]:
df.index = list(range(6,11))    # 인덱스 재설정
df.head()

   first_name last_name  age           city
6       Jason    Miller   42  San Francisco
7       Molly  Jacobson   52      Baltimore
8        Tina       Ali   36          Miami
9        Jake    Milner   24        Douglas
10        Amy     Cooze   73         Boston

In [69]:
df.drop(10)    # index value

  first_name last_name  age           city
6      Jason    Miller   42  San Francisco
7      Molly  Jacobson   52      Baltimore
8       Tina       Ali   36          Miami
9       Jake    Milner   24        Douglas

In [71]:
# 축을 기준으로 삭제
df.drop("city", axis=1).head()

   first_name last_name  age
6       Jason    Miller   42
7       Molly  Jacobson   52
8        Tina       Ali   36
9        Jake    Milner   24
10        Amy     Cooze   73

In [72]:
# 다시 출력해보면, 10 인덱스 값도 있고 city 컬럼값도 존재한다
# 원본 데이터를 삭제하지 않는다.
# 원본 데이터를 삭제하고 싶다면 속성 inplace=True 추가
df

   first_name last_name  age           city
6       Jason    Miller   42  San Francisco
7       Molly  Jacobson   52      Baltimore
8        Tina       Ali   36          Miami
9        Jake    Milner   24        Douglas
10        Amy     Cooze   73         Boston

##### Series operation

In [75]:
s1 = Series(range(1,7), index=list("qwerty"))
s1

q    1
w    2
e    3
r    4
t    5
y    6
dtype: int64

In [76]:
s2 = Series(range(7,12), index=list("werty"))
s2

w     7
e     8
r     9
t    10
y    11
dtype: int64

In [78]:
s1 + s2    
# index 기준으로 연산 수행
# 겹치는 인덱스가 없을 경우 NaN값으로 반환

e    11.0
q     NaN
r    13.0
t    15.0
w     9.0
y    17.0
dtype: float64

In [79]:
s1.add(s2, fill_value=0)    # NaN 을 변환

e    11.0
q     1.0
r    13.0
t    15.0
w     9.0
y    17.0
dtype: float64

In [80]:
# Numeric type 데이터의 요약정보를 보여줌
df.describe()

             age
count   5.000000
mean   45.400000
std    18.460769
min    24.000000
25%    36.000000
50%    42.000000
75%    52.000000
max    73.000000

In [83]:
# unique 유일한 값
df.first_name.unique()

array(['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], dtype=object)